app/Http/Controllers/Api/Auth/AuthController.php

select * from `users` where `mobile` = '09354068701' and `users`.`deleted_at` is null limit 1
update `users` set `otp_code` = 6082, `expiration_otp` = '2022-12-19 18:10:29', `users`.`updated_at` = '2022-12-19 18:09:29' where `id` = 1
---
    public function login(LoginRequest $request)
    {
        try
        {
            $attributes = $request->validated();
            $otpCode = mt_rand(100000, 999999);
            $user = User::query()->where('mobile', $attributes['mobile'])->firstOrFail();
            $user->update([
               'otp_code' => $otpCode,
               'expiration_otp' => Carbon::now()->addMinutes()
            ]);

select * from `users` where `mobile` = '09350000000' and `otp_code` = '6237' and `expiration_otp` >= '2022-12-19 18:34:11' and `users`.`deleted_at` is null limit 1
update `users` set `login_count` = 1, `activation_date` = '2022-12-19 18:34:11', `users`.`updated_at` = '2022-12-19 18:34:11' where `id` = 1
---
    public function checkOtp(OtpRequest $request)
    {
       try
       {
           $attributes = $request->validated();
            $user = User::query()->where('mobile', $attributes['mobile'])->where('otp_code', $attributes['otp_code'])
              ->where('expiration_otp', ">=", Carbon::now())->firstOrFail();
                $user->update(['activation_date' => Carbon::now()]);