<?php

return [
    'otp' => [
        'sent' => 'کد ورود به سیستم',
        'code' => 'کد شش رقمی'
        ],
        'logout' => 'از حساب کاربری خود با موفقیت خارج شدید',
            'company' =>
                [
                    'profile' =>
                        [
                            'invalid'  => [
                                'avatar' => 'فایل ارسالی شما نا معتبر است مجددا امتحان کنید',
                                'verify' => 'کد ورودی شما نامعتبر است'
                            ]
                        ],
                    'coin_value' => 'مقدار وارد شده صحیح نیست',
                    'company_system_value' => 'مشکلی در فرایند محاسبه رخ داده است'
                ],
    'currency' =>
        [
            'invalid' =>
                [
                    'balance' => 'موجودی شما کافی نیست',
                    'exchange' => 'عملیات تغییر ارز به مشکل خورده است مجددا امتحان کنید',
                    'coin_value' => 'ارزش سکه از مقدار وارد شده بیشتر است'
                ],
            'withdrawal' => 'فرایند برداشت وجه به مشضکل خورده است مجددا امتحان کنید '
        ],
];
