<?php

return [
    'otp' => [
        'sent' => 'کد ورود به سیستم',
        'code' => 'کد شش رقمی'
        ],
        'logout' => 'از حساب کاربری خود با موفقیت خارج شدید',
            'company' =>
                [
                    'profile' =>
                        [
                            'invalid'  => [
                                'avatar' => 'فایل ارسالی شما نا معتبر است مجددا امتحان کنید',
                                'verify' => 'کد ورودی شما نامعتبر است'
                            ]
                        ],
                    'market' =>
                        [
                        'invalid' => [
                          'request' => [
                              'درخواست شما نامعتبر است دوباره امتحان کنید',
                          ],
                            'amount' => 'موجودی به اتمام رسیده است',
                        ],
                            'success' => [
                               'buy' => 'محصول با موفقیت خریداری شد'
                            ],
                            'destroy' => 'محصول با موفقیت حذف شد'
                    ],
                    'giftCard' => [
                        'success' => [
                            'delete' => 'کارت هدیه مورد نظر با موفقیت حذف شد'
                        ],
                        'invalid' => [
                            'request' => 'درخواست نامعتبر است',
                            'delete' => 'حذف کارت هدیه دچار مشکل شده مجددا امتحان کنید'
                        ],
                        'send' => 'هدیه برای کاربر ارسال شد'
                    ],
                    'search' => [
                        'invalid' => [
                            'user' => 'کاربر مورد نظر پیدا نشد',
                            'medal' => 'مدال موردنظر پیدا نشد'
                        ]
                    ],
                    'setting' => [
                      'permission' => [
                          'invalid' => 'در حال حاضر امکان برداشت وجه مقدور نیست'
                      ],
                        'min' => [
                            'invalid' => 'مقدار وارد شده کمتر از حد مجاز است'
                        ]
                    ],
                    'coin_value' => 'مقدار وارد شده صحیح نیست',
                    'company_system_value' => 'مشکلی در فرایند محاسبه رخ داده است'
                ],
    'currency' =>
        [
            'invalid' =>
                [
                    'balance' => 'موجودی شما کافی نیست',
                    'exchange' => 'عملیات تغییر ارز به مشکل خورده است مجددا امتحان کنید',
                    'coin_value' => 'ارزش سکه از مقدار وارد شده بیشتر است'
                ],
            'withdrawal' => 'فرایند برداشت وجه به مشضکل خورده است مجددا امتحان کنید '
        ],
];
